// PrayerCard.jsx
import React from "react";
import { Card, CardContent } from "@mui/material";

const PrayerCard = React.forwardRef(({ background, textStyle, firstName, lastName }, ref) => (
  <Card
    ref={ref}
    sx={{
      width: { xs: "100%", md: "7.4cm" },
      height: { xs: "auto", md: "21cm" },
      padding: "2rem",
      boxShadow: 3,
      textAlign: "right",
      background: `linear-gradient(rgba(250, 250, 250, 0.61), rgba(255, 255, 255, 0.5)), url(${background})`,
      backgroundSize: "cover",
      backgroundPosition: "center",
      backgroundRepeat: "no-repeat",
      position: "relative",
      color: "black",
      alignSelf: "flex-start",
    }}
  >
    <CardContent>
      <div
        style={{
          marginBottom: "2rem",
          ...textStyle,
          textAlign: "center",
          fontSize: "24px",
          color: "#2c3e50",
          textShadow: "2px 2px 4px rgba(0,0,0,0.1)",
          padding: "10px",
          borderBottom: "2px solid rgb(2, 2, 2)",
          borderTop: "2px solid rgb(0, 0, 0)",
          background: "rgba(255,255,255,0.7)",
          borderRadius: "8px",
        }}
      >
        תפילה לחופה
      </div>

      <p
        style={{
          ...textStyle,
          fontSize: "16px",
          lineHeight: "1.20",
          letterSpacing: "0.9",
        }}
      >
            רִבּוֹנוֹ שֶׁל עוֹלָם בְּשָׁעָה בָּהּ עוֹמְדִים <br />
              <b> הֶחָתָן {firstName}</b>, <br />
              <b> וְהַכַּלָּה {lastName}</b> <br />
              תַּחַת הַחֻפָּה לִבְנוֹת בַּיִת נֶאֱמָן בְּיִשְׂרָאֵל, אָנָּא
              בְּרַחֲמֶיךָ הָרַבִּים זַכֵּם לְהָקִים בַּיִת כָּשֵׁר וְנֶאֱמָן
              וְיִהְיֶה בֵּיתָם בִּנְיַן עֲדֵי עַד עַל אַדְנֵי הַתּוֹרָה
              וְהַיִּרְאָה, וְתַשְׁרֶה שְׁכִינָתְךָ בְּבֵיתָם מִתּוֹךְ אַהֲבָה
              וְאַחְוָה, הֲבָנָה שָׁלוֹם וְרֵעוּת. תֵּן לָהֶם חַיִּים אֲרֻכִּים
              וְטוֹבִים שֶׁל שִׂמְחָה אֲמִתִּית וּפְנִימִית מִתּוֹךְ יִשּׁוּב
              הַדַּעַת וְשַׁלְוָה וּבְרִיאוּת אֵיתָנָה, בַּרְכֶם בְּכָל מִינֵי
              בְּרָכָה וְתַשְׁפִּיעַ עֲלֵיהֶם מִשֶּׁפַע אוֹצָרְךָ הַטּוֹב,
              וְהַצְלִיחֵם בְּרוּחָנִיּוּת וּבְגַּשְׁמִיּוּת בְּכָל מִילֵי
              דְּמֵיטָב, פַּרְנָסָה בְּכָבוֹד וּבְרֶוַח, וּתְזַכֵּם בְּמָּקוֹם
              יִשּׁוּב נֹחַ וּמֻצְלָח, לְקַיֵּם כָּל דִּבְרֵי תּוֹרָתֵנוּ
              הַקְּדוֹשָׁה מִתּוֹךְ יִרְאַת שָׁמַיִם טְהוֹרָה, אַהֲבָה
              וְשִׂמְחָה תְּמִידִית.
              <br />
              <br></br>
              <b>וּבְכֵן יְהִי רָצוֹן מִלְּפָנֶיךָ,</b> מֶלֶךְ רָם וְנִשָּׂא
              שֶׁתְּבָרְכֵם בְּבִרְכַּת שָׁמַיִם וּתְזַכֵּם לְהִפָּקֵד בְּזֶרַע
              קֹדֶשׁ שֶׁל קְיָמָא לְהַעֲמִיד דּוֹרֵי דּוֹרוֹת שֶׁל בָּנִים
              וּבָנוֹת צַדִּיקִים וִישָׁרִים, כֻּלָּם שׁוֹמְרֵי תּוֹרָה
              וּמְקַיְּמֵי מִצְווֹת מִתּוֹךְ יִרְאַת שָׁמַיִם טְהוֹרָה
              וּבְרִיאוּת אֵיתָנָה, וְיִרְאוּ הֵם רֹב נַחַת וְאֹשֶׁר, וּפְרֹשׂ
              סֻכַּת שְׁלוֹמְךָ עַל כָּל יוֹצְאֵי חַלָצֵיהֶם וְעַל כָּל
              הַמְּחֻתָּנִים שֶׁיִּחְיוּ, וְנִזְכֶּה כֻּלָּנוּ יַחַד לְהַקְבִּיל
              פְּנֵי מְשִׁיחַ צִדְקֵנוּ, לִרְאוֹת בְּבִנְיַן בֵּית
              מִקְדָּשֵׁנוּ וְתִפְאַרְתֵּנוּ בִּכְלַל עַמְּךָ בֵּית יִשְׂרָאֵל
              בִּמְהֵרָה בְּיָמֵינוּ, אָמֵן.
            </p>
    </CardContent>
  </Card>
));

export default PrayerCard;
